books/CommutativeAlgebraAtiyah.org
#+TITLE: Commutative Algebra
#+AUTHOR: M. F. Atiyah & I. G. MacDonald

#+EXPORT_FILE_NAME: ../latex/CommutativeAlgebraAtiyah/CommutativeAlgebraAtiyah.tex
#+LATEX_HEADER: \graphicspath{{../../books/}}
#+LATEX_HEADER: \input{preamble.tex}
#+LATEX_HEADER: \makeindex

