latex/CommutativeAlgebraAtiyah/CommutativeAlgebraAtiyah.tex
% Created 2021-10-09 Sat 17:40
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\graphicspath{{../../books/}}
\input{preamble.tex}
\makeindex
\author{M. F. Atiyah \& I. G. MacDonald}
\date{\today}
\title{Introduction to Commutative Algebra}
\hypersetup{
 pdfauthor={M. F. Atiyah \& I. G. MacDonald},
 pdftitle={Introduction to Commutative Algebra},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents
