books/CommutativeAlgebraAtiyah.org
** Exercise
    #+BEGIN_exercise
    label:ex1.1
    Let \(x\) be a nilpotent element of a ring \(A\). Show that \(1+x\) is a unit of \(A\). Deduce
    that the sum of a nilpotent element and a unit is a unit
    #+END_exercise

    #+BEGIN_proof
    \(x\) is a element of a nilradical, which is the intersection all prime ideals. Since every
    maximal ideal is a prime ideal, then nilradical is a subset of Jacobson radical.
    Then \(1-(-u^{-1})x\) is a unit for some unit \(u\), hence \(u+x\) is a unit
    #+END_proof
