latex/CommutativeAlgebraAtiyah/CommutativeAlgebraAtiyah.tex
\subsection{Exercise}
\label{sec:org92bcb9f}
\begin{exercise}
\label{ex1.1}
Let \(x\) be a nilpotent element of a ring \(A\). Show that \(1+x\) is a unit of \(A\). Deduce
that the sum of a nilpotent element and a unit is a unit
\end{exercise}

\begin{proof}
\(x\) is a element of a nilradical, which is the intersection all prime ideals. Since every
maximal ideal is a prime ideal, then nilradical is a subset of Jacobson radical.
Then \(1-(-u^{-1})x\) is a unit for some unit \(u\), hence \(u+x\) is a unit
\end{proof}
\end{document}
